c5/src/Catalogs/AddressBook/AddressBook.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AddressBook</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Users</owners>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Catalogs/Projects/Projects.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Projects</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Organizations</owners>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Appearance</name>
    <type>
      <types>CatalogRef.CalendarAppearance</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Completed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompletionDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Cost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Data</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DocumentRef.IncomingEmail</types>
      <types>DocumentRef.OutgoingEmail</types>
    </type>
  </attributes>
  <attributes>
    <name>Folder</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HourlyRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Manager</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ObligatoryTasks</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PaidMinutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Pricing</name>
    <type>
      <types>EnumRef.ProjectsPricing</types>
    </type>
  </attributes>
  <attributes>
    <name>ProjectType</name>
    <type>
      <types>EnumRef.ProjectTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>UseApprovingProcess</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ApprovalList</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Priority</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tasks</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>HourlyCost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>HourlyRate</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
    <attributes>
      <name>Minutes</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Task</name>
      <type>
        <types>CatalogRef.Tasks</types>
      </type>
    </attributes>
    <attributes>
      <name>TimeType</name>
      <type>
        <types>EnumRef.Time</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/Catalogs/AddressBook/Forms/Choice/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	setListsMultipleChoice ();
	setMultipleChoiceVisibility ();
	setDefaultButton ( ThisObject, Items.Pages.CurrentPage );
	
EndProcedure

&AtServer
Procedure setListsMultipleChoice ()
	
	Items.List.MultipleChoice = Parameters.MultipleSelection;
	Items.Users.MultipleChoice = Parameters.MultipleSelection;
	Items.Customers.MultipleChoice = Parameters.MultipleSelection;
	Items.Employees.MultipleChoice = Parameters.MultipleSelection;
	
EndProcedure 

&AtServer
Procedure setMultipleChoiceVisibility ()
	
	Items.MultipleChoice.Visible = Parameters.MultipleSelection;
	
EndProcedure 

&AtClientAtServerNoContext
Procedure setDefaultButton ( Form, CurrentPage )
	
	items = Form.Items;
	if ( CurrentPage = Items.UsersPage ) then
		items.UsersChoose.DefaultButton = true;
	elsif ( CurrentPage = items.CustomersPage ) then
		items.CustomersChoose.DefaultButton = true;
	elsif ( CurrentPage = items.EmployeesPage ) then
		items.EmployeesChoose.DefaultButton = true;
	elsif ( CurrentPage = items.AddressBookPage ) then
		items.AddressesChoose.DefaultButton = true;
	endif; 
	
EndProcedure 

// *****************************************
// *********** Group Employees

&AtClient
Procedure PagesOnCurrentPageChange ( Item, CurrentPage )
	
	setDefaultButton ( ThisObject, CurrentPage );
	
EndProcedure

// *****************************************
// *********** Group Employees

&AtClient
Procedure ProjectFilterOnChange ( Item )
	
	filterByProject ();
	
EndProcedure

&AtServer
Procedure filterByProject ()
	
	if ( ProjectFilter.IsEmpty () ) then
		DC.ChangeFilter ( Employees, "Ref", undefined, false );
	else
		employeesList = getEmployeesList ();
		DC.ChangeFilter ( Employees, "Ref", employeesList, true, DataCompositionComparisonType.InListByHierarchy );
	endif; 
	
EndProcedure 

&AtServer
Function getEmployeesList ()
	
	s = "
	|select allowed distinct Tasks.Employee as Employee
	|from Catalog.Projects.Tasks as Tasks
	|where Tasks.Ref = &Project
	|";
	q = new Query ( s );
	q.SetParameter ( "Project", ProjectFilter );
	return q.Execute ().Unload ().UnloadColumn ( "Employee" );
	
EndFunction 

&AtClient
Procedure ListValueChoice ( Item, Value, StandardProcessing )
	
	chooseValue ( Item, Value, StandardProcessing );
	
EndProcedure

&AtClient
Procedure chooseValue ( Item, Value, StandardProcessing )
	
	StandardProcessing = false;
	addresses = new Array ();
	if ( Item.MultipleChoice ) then
		for each selectedValue in Value do
			addresses.Add ( Item.RowData ( selectedValue ).Email );
		enddo; 
	else
		addresses.Add ( Item.RowData ( Value ).Email );
	endif; 
	NotifyChoice ( StrConcat ( addresses, ", " ) );
	
EndProcedure 

&AtClient
Procedure UsersValueChoice ( Item, Value, StandardProcessing )
	
	chooseValue ( Item, Value, StandardProcessing );
	
EndProcedure

&AtClient
Procedure CustomersValueChoice ( Item, Value, StandardProcessing )
	
	chooseValue ( Item, Value, StandardProcessing );
	
EndProcedure

&AtClient
Procedure EmployeesValueChoice ( Item, Value, StandardProcessing )
	
	chooseValue ( Item, Value, StandardProcessing );
	
EndProcedure
